src/cf/Documents/GDS_ДоставкаГСМ_РаспределениеДоходовПоТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_ДоставкаГСМ_РаспределениеДоходовПоТС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МеКаМи_КВыгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширеннаяИнформацияОЛокации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПУ_Расширенный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ПоПЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПЛ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Грузоотправитель или грузополучатель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУслуг</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщийУчасток</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширеннаяИнформацияОЛокации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПУ_Расширенный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатПеремещениеТоваров</Name>
			<Comment>Перемещение материалов (уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.уатРемонтныйЛист</xr:Item>
				<xr:Item>Document.уатВыдачаРасходныхМатериалов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатТоварыВЯчейках</xr:Item>
				<xr:Item>InformationRegister.уатДатыДвиженияТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатВыдачаРасходныхМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/GDS_ПУ_Расширенный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>GDS_ПУ_Расширенный</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПрибытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетальнаяИнформацияПоПериодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РастояниеСГрузом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РастояниеТудаОбратно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемРазгрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТонноКилометры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкоростьСредняя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаТ_Км</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаТонну</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаТоннуСУчетомЛогистики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/GDS_ДоставкаГСМ_РаспределениеДоходовПоТС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Пикчер = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ВыгруженоВМЕКАМИНЕФТЬ,УникальныйИдентификатор);
	//Элементы.Пикчер.Видимость = ПоказатьКартинку();
	
	ЗаполнитьСписокЛокаций();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МожноЗаписывать = ПроверитьВозможностьПроведения();
	Если НЕ МожноЗаписывать Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ТЧ_ПоПЛОтправитьПутевыеЛисты.Доступность = ЛОЖЬ;
		Элементы.ТЧЗаполнить.Доступность = ЛОЖЬ;
	КонецЕсли;
	
	//Для каждого Строка из Объект.ТЧ_ПоПЛ Цикл
	//	Строка.Статус = МеКаМи_ФункцииСПовторнымИспользованием.ВернутьСтатусДокумента(Строка.ПЛ);
	//КонецЦикла;	
	
	Если Объект.Проведен Тогда
		
		Сообщить("Форма документа открыта на просмотр. Проведенный документ запрещено редактировать!");
		ЭтаФорма.ТолькоПросмотр = Истина; 
		ЭтаФорма.Элементы.ТЧ.КоманднаяПанель.Доступность = ЛОЖЬ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛокаций()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_ПУ_Расширенный.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.GDS_ПУ_Расширенный КАК GDS_ПУ_Расширенный";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого строкаТЗ из ТЗ Цикл
		Нашли  = ЛОЖЬ;
    	Для каждого Строка из СписокЛокаций Цикл
			Если Строка.Значение = СтрокаТЗ.Ссылка Тогда
				Нашли = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		Если не Нашли ТОгда
			СписокЛокаций.Добавить(СтрокаТЗ.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	Если ГруппаТС.Пустая() Тогда
		сообщ=Новый СообщениеПользователю;
		сообщ.Текст = "Укажите в какой группе находятся перевозчики ГСМ!";
		сообщ.Поле="ГруппаТС";
		сообщ.ПутьКДанным = "Объект";
		сообщ.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивЛокаций = Новый Массив;
	Для каждого Элем из СписокЛокаций Цикл
		Если Элем.Значение.пустая() Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ Элем.Пометка Тогда
			Продолжить;
		КонецЕсли;
		МассивЛокаций.Добавить(Элем.Значение);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПеремещениеТоваровТовары.Ссылка.МеКаМи_РасширеннаяИнформацияОЛокации КАК РасширеннаяИнформацияОЛокации,
		|	СУММА(уатПеремещениеТоваровТовары.Количество) КАК Количество,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК СкладОтправитель,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладПолучатель КАК СкладПолучатель,
		|	уатПеремещениеТоваровТовары.Ссылка.МеКаМи_РасширеннаяИнформацияОЛокации КАК ПУ,
		|	уатПеремещениеТоваровТовары.Ссылка.Локация КАК Локация,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладПолучатель.Контрагент КАК СкладПолучательЗаказчик,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладПолучатель.ТС КАК СкладПолучательТС,
		|	уатПеремещениеТоваровТовары.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.уатПеремещениеТоваров.Товары КАК уатПеремещениеТоваровТовары
		|ГДЕ
		|	уатПеремещениеТоваровТовары.Ссылка.Дата МЕЖДУ &Нач И &Кон
		|	И уатПеремещениеТоваровТовары.Ссылка.МеКаМи_РасширеннаяИнформацияОЛокации В(&МассивЛокаций)
		|	И (уатПеремещениеТоваровТовары.Ссылка.Проведен
		|			ИЛИ уатПеремещениеТоваровТовары.Ссылка.МеКаМи_ПоказыватьВОтчетеДвижениеГСМ)
		|	И уатПеремещениеТоваровТовары.Номенклатура = &Номенклатура
		|	И уатПеремещениеТоваровТовары.Ссылка.СкладПолучатель.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	уатПеремещениеТоваровТовары.Ссылка.МеКаМи_РасширеннаяИнформацияОЛокации,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
		|	уатПеремещениеТоваровТовары.Ссылка.Локация,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладПолучатель.ТС,
		|	уатПеремещениеТоваровТовары.Ссылка.Дата,
		|	уатПеремещениеТоваровТовары.Ссылка.СкладПолучатель.Контрагент,
		|	уатПеремещениеТоваровТовары.Ссылка.МеКаМи_РасширеннаяИнформацияОЛокации";
	
	
	Запрос.Параметры.Вставить("МассивЛокаций",МассивЛокаций);
	Запрос.Параметры.Вставить("Номенклатура",Справочники.Номенклатура.НайтиПоКоду("00000000002"));
	Запрос.Параметры.Вставить("Нач",НачалоМесяца(Объект.Дата));
	Запрос.Параметры.Вставить("Кон",КонецМесяца(Объект.Дата));
	Запрос.Параметры.Вставить("Контрагент",Объект.Контрагент);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("РасширеннаяИнформацияОЛокации, ПУ, СкладОтправитель, СкладПолучатель, СкладПолучательЗаказчик, СкладПолучательТС, Локация, Дата","количество");
	ТЗ.Сортировать("ПУ, СкладОтправитель");
	
	ТЗ.Колонки.Добавить("Цена");
	Для Каждого Строка из ТЗ Цикл
		Строка.Цена = 0;
		КолСтр = Строка.РасширеннаяИнформацияОЛокации.ДетальнаяИнформацияПоПериодам.Количество();
		Пока КолСтр<>0 Цикл
			ТекСтр = Строка.РасширеннаяИнформацияОЛокации.ДетальнаяИнформацияПоПериодам[КолСтр-1];
		    Если НачалоМесяца(Объект.Дата) >= ТекСтр.Период Тогда
				Строка.Цена = ТекСтр.ЦенаЗаТоннуСУчетомЛогистики;
			КонецЕсли;
			КолСтр = КолСтр - 1;
		КонецЦикла;
	КонецЦикла;
	
	ТЗ_ДляТЧ = Объект.ТЧ.Выгрузить();
	ТЗ_ДляТЧ.Очистить();
	
	Для Каждого Строка из ТЗ Цикл
		Если Строка.СкладПолучательЗаказчик.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		НовСтр = ТЗ_ДляТЧ.Добавить();
		НовСтр.Склад = Строка.СкладОтправитель;
		НовСтр.Сумма = Строка.цена * Строка.Количество;
		НовСтр.Заказчик = Строка.СкладПолучательЗаказчик;
		НовСтр.ПУ = Строка.Локация;
		НовСтр.ТС = ПолучитьТС(Строка.СкладОтправитель,Строка.Дата);
		НовСтр.Количество = Строка.Количество;
		НовСтр.РасширеннаяИнформацияОЛокации = Строка.РасширеннаяИнформацияОЛокации;
	КонецЦикла;
	ТЗ_ДляТЧ.Свернуть("Склад,Заказчик,ПУ,ТС,РасширеннаяИнформацияОЛокации","Сумма,Количество");
	Объект.ТЧ.Загрузить(ТЗ_ДляТЧ);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТС(СкладОтправитель,Дата) 
	
	ТС = СкладОтправитель.ТС;
	Если ТС.Пустая() Тогда
		Сообщить("ТС для склада " + СкладОтправитель + " не определен!");
		Возврат Справочники.уатТС.ПустаяСсылка();
	КонецЕсли;	
	Если ТС.ПринадлежитЭлементу(ГруппаТС) Тогда
		Возврат ТС;
	КонецЕсли;
	
	//Если это АТЗ то ищем когда заливался с поезда последний раз и подставим поезд
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
		|	уатПеремещениеТоваров.Ссылка КАК Ссылка,
		|	уатПеремещениеТоваров.Дата КАК Дата,
		|	уатПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель
		|ИЗ
		|	Документ.уатПеремещениеТоваров КАК уатПеремещениеТоваров
		|ГДЕ
		|	уатПеремещениеТоваров.Дата <= &Дата
		|	И уатПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
		|	И уатПеремещениеТоваров.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладОтправитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТС = ВыборкаДетальныеЗаписи.СкладОтправитель.ТС;
		Если ТС.Пустая() Тогда
			Продолжить;
		КонецЕсли;	
		Если ТС.ПринадлежитЭлементу(ГруппаТС) Тогда
			Возврат ТС;
		КонецЕсли;
	КонецЦикла;
	Сообщить("Есть ошибка! ТС для склада " + СкладОтправитель + " нет получения ГСМ с автопоезда");
	Возврат Справочники.уатТС.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТЧ = ТекущийОбъект.ТЧ.Выгрузить();
	ТЧ.Свернуть("ТС","");
	СписокТС = ТЧ.ВыгрузитьКолонку("ТС");
	ТекущийОбъект.ТЧ_ПоПЛ.Очистить();
	ТЧ = ТекущийОбъект.ТЧ_ПоПЛ.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство КАК ТранспортноеСредство,
		|	СУММА(ВЫБОР
		|			КОГДА уатПутевойЛистЗадание.КоличествоЧасов = 0
		|				ТОГДА 11
		|			ИНАЧЕ уатПутевойЛистЗадание.КоличествоЧасов
		|		КОНЕЦ) КАК КоличествоЧасов,
		|	уатПутевойЛистЗадание.Ссылка КАК Ссылка,
		|	СУММА(уатПутевойЛистЗадание.КоличествоЧасов) КАК КоличествоЧасовТест
		|ПОМЕСТИТЬ ВыборкаПЛ
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И уатПутевойЛистЗадание.Ссылка.Проведен
		|	И уатПутевойЛистЗадание.Ссылка.Рассчитан
		|	И уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство В(&СписокТС)
		|	И ВЫБОР
		|			КОГДА уатПутевойЛистЗадание.МеКаМи_ВидУслуг.НеОплачиваемые = ИСТИНА
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//|	И уатПутевойЛистЗадание.Контрагент = &ОсновнойКонтрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство,
		|	уатПутевойЛистЗадание.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыборкаПЛ.ТранспортноеСредство КАК ТранспортноеСредство,
		|	СУММА(ВыборкаПЛ.КоличествоЧасов) КАК ВсегоКоличествоЧасов
		|ПОМЕСТИТЬ ВыборкаВсего
		|ИЗ
		|	ВыборкаПЛ КАК ВыборкаПЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыборкаПЛ.ТранспортноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыборкаПЛ.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВыборкаПЛ.КоличествоЧасов КАК КоличествоЧасов,
		|	ВыборкаПЛ.Ссылка КАК Ссылка,
		|	ВыборкаВсего.ВсегоКоличествоЧасов КАК ВсегоКоличествоЧасов,
		|	ВыборкаПЛ.КоличествоЧасовТест КАК КоличествоЧасовТест
		|ИЗ
		|	ВыборкаПЛ КАК ВыборкаПЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыборкаВсего КАК ВыборкаВсего
		|		ПО ВыборкаПЛ.ТранспортноеСредство = ВыборкаВсего.ТранспортноеСредство";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("СписокТС", СписокТС);
    ОсновнаяОрганизацияМеКаМи = Справочники.Контрагенты.НайтиПоНаименованию("АО ""СП ""МеКаМинефть""",Истина);	
    //ОсновнаяОрганизацияМеКаМи = Справочники.Контрагенты.НайтиПоНаименованию("ООО ""Ситэк-Транс""",Истина);	
	
	Запрос.УстановитьПараметр("ОсновнойКонтрагент", ОсновнаяОрганизацияМеКаМи);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из ТекущийОбъект.ТЧ Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ТранспортноеСредство", Строка.ТС);
		СтрокиРаспределения = ТЗ.НайтиСтроки(Отбор);
		Сумма = Строка.Сумма;
		Количество = Строка.Количество;
		Если СтрокиРаспределения.Количество() = 0 Тогда
			Отказ = Истина;
			Сообщить("Нет путевых листов с заказчиком АО ""СП ""МеКаМинефть"" за данный месяц для ТС: " + Строка.ТС);
			Сообщить("Это ошибка!");
			Прервать;
		КонецЕсли;	
		Для каждого СтрокаТЗ из СтрокиРаспределения Цикл
			КолСтрокПЛ = СтрокаТЗ.Ссылка.Задание.Количество();
			Если КолСтрокПЛ = 0 Тогда
				НовСтр = ТЧ.Добавить();
				НовСтр.РасширеннаяИнформацияОЛокации = Строка.РасширеннаяИнформацияОЛокации;
				НовСтр.ТС         = Строка.ТС;
				НовСтр.Заказчик   = Строка.Заказчик;
				НовСтр.ПУ         = Строка.ПУ;
				НовСтр.ПЛ         = СтрокаТЗ.Ссылка;
				НовСтр.Сумма      = Строка.Сумма * (СтрокаТЗ.КоличествоЧасов/СтрокаТЗ.ВсегоКоличествоЧасов);
				НовСтр.Количество = Строка.Количество * (СтрокаТЗ.КоличествоЧасов/СтрокаТЗ.ВсегоКоличествоЧасов);
				Сумма = Сумма - НовСтр.Сумма;
				Количество = Количество - НовСтр.Количество;
			Иначе
				Коэф = 1 / КолСтрокПЛ;
				Для каждого СтрокаПЛ из СтрокаТЗ.Ссылка.Задание Цикл
					НовСтр = ТЧ.Добавить();
					НовСтр.ТС       = Строка.ТС;
					НовСтр.Заказчик = Строка.Заказчик;
					НовСтр.ПУ       = Строка.ПУ;
					НовСтр.ПЛ       = СтрокаТЗ.Ссылка;
					НовСтр.РасширеннаяИнформацияОЛокации = Строка.РасширеннаяИнформацияОЛокации;
					
					НовСтр.Контрагент           = Строка.Заказчик;
					НовСтр.Маршрут              = СтрокаПЛ.Маршрут;
					НовСтр.Подразделение        = СтрокаПЛ.Подразделение;
					НовСтр.ВидУслуг      = СтрокаПЛ.ВидУслуг;
					НовСтр.ОбщийУчасток  = СтрокаПЛ.ОбщийУчасток;
					
					НовСтр.Сумма      = Строка.Сумма * (СтрокаТЗ.КоличествоЧасов/СтрокаТЗ.ВсегоКоличествоЧасов) * Коэф;
					НовСтр.Количество = Строка.Количество * (СтрокаТЗ.КоличествоЧасов/СтрокаТЗ.ВсегоКоличествоЧасов) * Коэф;
					Сумма = Сумма - НовСтр.Сумма;
					Количество = Количество - НовСтр.Количество;
				КонецЦикла;	
			КонецЕсли;
			
		КонецЦикла;
		Если Сумма <> 0 или Количество <> 0 Тогда
			НовСтр.Сумма = НовСтр.Сумма + Сумма;
			НовСтр.Количество = НовСтр.Количество + Количество;
		КонецЕсли;	
	КонецЦикла;
	ТЧ.Свернуть("ТС, Заказчик, ПЛ, ПУ, Контрагент, Маршрут, Подразделение, ВидУслуг, ОбщийУчасток, РасширеннаяИнформацияОЛокации","Сумма,Количество");
	ТекущийОбъект.ТЧ_ПоПЛ.Загрузить(ТЧ);
	
КонецПроцедуры

&НаСервере
Функция ВернутьСтатусДокумента(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МеКаМи_СостояниеПутевогоЛиста.СогласуемыйДокумент КАК СогласуемыйДокумент,
		|	МеКаМи_СостояниеПутевогоЛиста.Результат КАК Результат,
		|	МеКаМи_СостояниеПутевогоЛиста.РезультатЦифрой КАК РезультатЦифрой,
		|	МеКаМи_СостояниеПутевогоЛиста.Коментарий КАК Коментарий,
		|	МеКаМи_СостояниеПутевогоЛиста.Период КАК Период
		|ИЗ
		|	РегистрСведений.МеКаМи_СостояниеПутевогоЛиста КАК МеКаМи_СостояниеПутевогоЛиста
		|ГДЕ
		|	МеКаМи_СостояниеПутевогоЛиста.СогласуемыйДокумент = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	    Возврат ВыборкаДетальныеЗаписи.Результат;
	Иначе
		Возврат "";
	КонецеСЛИ;	
		
КонецФункции	

&НаСервере
Функция ПроверитьВозможностьПроведения()

	Возврат Истина; //МеКаМи_ОбщегоНазначения.ПроверитьВозможностьПроведения(Объект.Дата);
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Для каждого Строка из Объект.ТЧ_ПоПЛ Цикл
	//	Строка.Статус = МеКаМи_ФункцииСПовторнымИспользованием.ВернутьСтатусДокумента(Строка.ПЛ);
	//КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//Для каждого Строка из Объект.ТЧ_ПоПЛ Цикл
	//	Строка.Статус = МеКаМи_ФункцииСПовторнымИспользованием.ВернутьСтатусДокумента(Строка.ПЛ);
	//КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПутевыеЛистыНаСервере()
	//Для Каждого Строка из Объект.ТЧ_ПоПЛ Цикл 
	//		Статус = МеКаМи_ФункцииСПовторнымИспользованием.ВернутьСтатусДокумента(Строка.ПЛ);
	//		Если НЕ ЗначениеЗаполнено(Статус) Тогда
	//			МеКаМи_ДополнительныеФункции.ОтправитьНаСогласование(Строка.ПЛ);	
	//			Строка.Статус = МеКаМи_ФункцииСПовторнымИспользованием.ВернутьСтатусДокумента(Строка.ПЛ);
	//		Иначе    
	//			Сообщить("" + Строка.ПЛ + " по строке " + Строка.НомерСтроки + " уже " + Статус);
	//		КонецЕсли;	
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПутевыеЛисты(Команда)
	ОтправитьПутевыеЛистыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МеКаМиКВыгрузкеПриИзменении(Элемент)
	Для каждого Строка из Объект.ТЧ_ПоПЛ Цикл
		Статус = ВернутьСтатусДокумента(Строка.ПЛ);
		Если Статус = "" Тогда
			Сообщить("Документ " + Строка.ПЛ + " не был согласован! Выгрузка не возможна!");
			Объект.МеКаМи_КВыгрузке = ЛОЖЬ;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПоказатьКартинку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МеКаМи_СтатусыВыгруженныхДокументов.ОбъектВыгрузки КАК ОбъектВыгрузки,
		|	МеКаМи_СтатусыВыгруженныхДокументов.Выгружать КАК Выгружать,
		|	МеКаМи_СтатусыВыгруженныхДокументов.Отправлен КАК Отправлен,
		|	МеКаМи_СтатусыВыгруженныхДокументов.Получен КАК Получен
		|ИЗ
		|	РегистрСведений.МеКаМи_СтатусыВыгруженныхДокументов КАК МеКаМи_СтатусыВыгруженныхДокументов
		|ГДЕ
		|	МеКаМи_СтатусыВыгруженныхДокументов.ОбъектВыгрузки = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Выгружать = Истина и ВыборкаДетальныеЗаписи.Отправлен = Истина и ВыборкаДетальныеЗаписи.Получен = Истина Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЛОЖЬ;

КонецФункции
